Revit 2026 API

# ColumnAttachmentGetColumnAttachment(FamilyInstance, ElementId) Method

---

Look up a column attachment by specifying the target id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ColumnAttachment GetColumnAttachment(
	FamilyInstance column,
	ElementId targetId
)
```
```vb
Public Shared Function GetColumnAttachment (
	column As FamilyInstance,
	targetId As ElementId
) As ColumnAttachment
```
```cpp
public:
static ColumnAttachment^ GetColumnAttachment(
	FamilyInstance^ column,
	ElementId^ targetId
)
```
```fsharp
static member GetColumnAttachment :
        column : FamilyInstance *
        targetId : ElementId -> ColumnAttachment
```

#### Parameters

column FamilyInstance
     A column.
targetId ElementId
     Id of a target element.

#### Return Value

ColumnAttachment The column attachment attaching the column to the target, or  if there is no such attachment.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

May return either a top or base attachment.

#### Reference

ColumnAttachment Class

GetColumnAttachment Overload

Autodesk.Revit.DB Namespace